{
    "sec_cik": "0001071739",
    "sec_company_name": "CENTENE CORP (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20220104",
    "sec_filing_date": "20220104",
    "sec_changed_date": "20220104",
    "sec_accepted_date": "20220104162813",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1071739/000114036122000513/0001140361-22-000513-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1071739/000114036122000513/0001140361-22-000513.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\003\CNC_0001071739_EX991_20220104_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "18540 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 11004,
    "endpoints": [
        "Exhibit 99.1 ",
        "All statements, other than statements of current or historical fact, contained in this press release are forward-looking statements. Without limiting the foregoing, forward-looking statements often use words such as “believe,” “anticipate,” “plan,” “expect,” “estimate,” “intend,” “seek,” “target,” “goal,” “may,” “will,” “would,” “could,” “should,” “can,” “continue” and other similar words or expressions (and the negative thereof). Centene (the Company, our, or we) intends such forward-looking statements to be covered by the safe-harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, and we are including this statement for purposes of complying with these safe-harbor provisions. In particular, these statements include, without limitation, statements about our future operating or financial performance, market opportunity, growth strategy, competition, expected activities in completed and future acquisitions, including statements about the impact of our proposed acquisition of Magellan Health (the Magellan Acquisition), our completed acquisition of WellCare Health Plans, Inc. (WellCare and such acquisition, the WellCare Acquisition), other recent and future acquisitions, investments, and the adequacy of our available cash resources. These forward-looking statements reflect our current views with respect to future events and are based on numerous assumptions and assessments made by us in light of our experience and perception of historical trends, current conditions, business strategies, operating environments, future developments and other factors we believe appropriate. By their nature, forward-looking statements involve known and unknown risks and uncertainties and are subject to change because they relate to events and depend on circumstances that will occur in the future, including economic, regulatory, competitive and other factors that may cause our or our industry’s actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements. These statements are not guarantees of future performance and are subject to risks, uncertainties and assumptions. All forward-looking statements included in this press release are based on information available to us on the date hereof. Except as may be otherwise required by law, we undertake no obligation to update or revise the forward-looking statements included in this press release, whether as a result of new information, future events or otherwise, after the date hereof. You should not place undue reliance on any forward-looking statements, as actual results may differ materially from projections, estimates, or other forward-looking statements due to a variety of important factors, variables and events including, but not limited to: the impact of COVID-19 on global markets, economic conditions, the healthcare industry and our results of operations and the response by governments and other third parties; our ability to accurately predict and effectively manage health benefits and other operating expenses and reserves, including fluctuations in medical utilization rates due to the impact of COVID-19; uncertainty as to the expected financial performance of the combined company following completion of the Magellan Acquisition; the possibility that the expected synergies and value creation from the Magellan Acquisition or the WellCare Acquisition (or other acquired businesses) will not be realized, or will not be realized within the respective expected time periods; the risk that unexpected costs will be incurred in connection with integration of the Magellan Acquisition or that the integration of Magellan Health will be more difficult or time consuming than expected, or similar risks from other acquisitions we may announce or complete from time to time; disruption from the integration of the Magellan Acquisition or from the integration of the WellCare Acquisition, or similar risks from other acquisitions we may announce or complete from time to time, including potential adverse reactions or changes to business relationships with customers, employees, suppliers or regulators, making it more difficult to maintain business and operational relationships; a downgrade of the credit rating of our indebtedness; the inability to retain key personnel; competition; membership and revenue declines or unexpected trends; changes in healthcare practices, new technologies and advances in medicine; increased healthcare costs; changes in economic, political or market conditions; changes in federal or state laws or regulations, including changes with respect to income tax reform or government healthcare programs as well as changes with respect to the Patient Protection and Affordable Care Act and the Health Care and Education Affordability Reconciliation Act (collectively referred to as the ACA) and any regulations enacted thereunder that may result from changing political conditions, the new administration or judicial actions; rate cuts or other payment reductions or delays by governmental payors and other risks and uncertainties affecting our government businesses; our ability to adequately price products; tax matters; disasters or major epidemics; changes in expected contract start dates; provider, state, federal, foreign and other contract changes and timing of regulatory approval of contracts; the expiration, suspension, or termination of our contracts with federal or state governments (including, but not limited to, Medicaid, Medicare, TRICARE or other customers); the difficulty of predicting the timing or outcome of legal or regulatory proceedings or matters, including, but not limited to, our ability to resolve claims and/or allegations made by states with regard to past practices, including at Envolve Pharmacy Solutions, Inc. (Envolve), as our pharmacy benefits manager (PBM) subsidiary, within the reserve estimate we have recorded and on other acceptable terms, or at all, or whether additional claims, reviews or investigations relating to our PBM business will be brought by states, the federal government or shareholder litigants, or government investigations; timing and extent of benefits from strategic value creation initiatives; challenges to our contract awards; cyber-attacks or other privacy or data security incidents; the exertion of management’s time and our resources, and other expenses incurred and business changes required in connection with complying with the undertakings in connection with any regulatory, governmental or third party consents or approvals for acquisitions; changes in expected closing dates, estimated purchase price and accretion for acquisitions; the risk that acquired businesses will not be integrated successfully; restrictions and limitations in connection with our indebtedness; our ability to maintain or achieve improvement in the Centers for Medicare and Medicaid Services (CMS) Star ratings and maintain or achieve improvement in other quality scores in each case that can impact revenue and future growth; availability of debt and equity financing, on terms that are favorable to us; inflation; foreign currency fluctuations and risks and uncertainties discussed in the reports that Centene has filed with the Securities and Exchange Commission. This list of important factors is not intended to be exhaustive. We discuss certain of these matters more fully, as well as certain other factors that may affect our business operations, financial condition and results of operations, in our filings with the Securities and Exchange Commission (SEC), including our annual report on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K. Due to these important factors and risks, we cannot give assurances with respect to our future performance, including without limitation our ability to maintain adequate premium levels or our ability to control our future medical and selling, general and administrative costs."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "CNC",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\003\CNC_0001071739_EX991_20220104_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 11,
    "batch_signature": "",
    "batch_start_time": "2023-04-17 00:20:00.439699",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-17 00:28:59.363302"
}