{
    "sec_cik": "0000005272",
    "sec_company_name": "AMERICAN INTERNATIONAL GROUP INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20180121",
    "sec_filing_date": "20180122",
    "sec_changed_date": "20180122",
    "sec_accepted_date": "20180122071404",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/5272/000119312518015274/0001193125-18-015274-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/5272/000119312518015274/0001193125-18-015274.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\002\AIG_0000005272_EX991_20180121_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "15495 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 11505,
    "endpoints": [
        "EX-99.1   ",
        " Non-GAAP Reconciliations Ratios: We, along with most property and casualty insurance companies, use the loss ratio, the expense ratio and the combined ratio as measures of underwriting performance. These ratios are relative measurements that describe, for every $100 of net premiums earned, the amount of losses and loss adjustment expenses (which for Commercial Insurance excludes net loss reserve discount), and the amount of other underwriting expenses that would be incurred. A combined ratio of less than 100 indicates underwriting income and a combined ratio of over 100 indicates an underwriting loss. Our ratios are calculated using the relevant segment information calculated under GAAP, and thus may not be comparable to similar ratios calculated for regulatory reporting purposes. The underwriting environment varies across countries and products, as does the degree of litigation activity, all of which affect such ratios. In addition, investment returns, local taxes, cost of capital, regulation, product type and competition can have an effect on pricing and consequently on profitability as reflected in underwriting income and associated ratios. Combined ratio excluding catastrophe losses: We believe this ratio is a meaningful measure of our underwriting results on an ongoing basis as they exclude catastrophes to provide meaningful information to our on-going insurance operations without the impact of the volatility of the natural and man-made catastrophe events from quarter to quarter. Underwriting ratios are computed as follows: a) Loss ratio = Loss and loss adjustment expenses incurred ÷ Net premiums earned (NPE) b) Acquisition ratio = Total acquisition expenses ÷ NPE c) General operating expense ratio = General operating expenses ÷ NPE d) Expense ratio = Acquisition ratio + General operating expense ratio e) Combined ratio = Loss ratio + Expense ratio f) Combined ratio excluding catastrophe losses = [Loss and loss adjustment expenses incurred – CATs] ÷ NPE +Expense ratio"
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "AIG",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\002\AIG_0000005272_EX991_20180121_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 7,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 22:17:42.947739",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 22:22:00.066267"
}