{
    "sec_cik": "0001122304",
    "sec_company_name": "AETNA INC /PA/ (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20150203",
    "sec_filing_date": "20150203",
    "sec_changed_date": "20150203",
    "sec_accepted_date": "20150203062855",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1122304/000112230415000020/0001122304-15-000020-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1122304/000112230415000020/0001122304-15-000020.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0004\004\AET_0001122304_EX991_20150203_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "775287 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 27898,
    "endpoints": [
        "2014 Q4 Earnings Press Release   ",
        "CAUTIONARY STATEMENT; ADDITIONAL INFORMATION -- -- Certain information in this press release is forward-looking, including our projections as to operating earnings per share, amortization of other acquired intangible assets, and weighted average diluted shares. Forward-looking information is based on management's estimates, assumptions and projections and is subject to significant uncertainties and other factors, many of which are beyond our control. Important risk factors could cause actual future results and other future events to differ materially from those currently estimated by management, including: unanticipated increases in medical costs (including increased intensity or medical utilization as a result of flu or otherwise; changes in membership mix to higher cost or lower-premium products or membership-adverse selection; medical cost increases resulting from unfavorable changes in contracting or re-contracting with providers (including as a result of provider consolidation and/or integration); and increased pharmacy costs (including in our health insurance exchange products)); the implementation of health care reform legislation, including collection of health care reform fees, assessments and taxes through increased premiums; adverse legislative, regulatory and/or judicial changes to or interpretations of existing health care reform legislation and/or regulations; the implementation of health insurance exchanges; the profitability of our public health insurance exchange and Medicare Advantage products, where membership is greater than our initial projections and may have more adverse health status and/or higher medical benefit utilization than we projected; our ability to achieve the synergies and value creation contemplated by the Coventry acquisition; our ability to effectively integrate Coventry's businesses; the diversion of management time on Coventry and/or bSwift integration-related issues; our ability to offset Medicare Advantage and PDP rate pressures; and changes in our future cash requirements, capital requirements, results of operations, financial condition and/or cash flows. Health care reform will continue to significantly impact our business operations and financial results, including our pricing and medical benefit ratios. Components of the legislation will be phased in over the next several years, with the most significant changes occurring in 2014, and we will be required to dedicate material resources and incur material expenses during that time to implement health care reform. Many significant parts of the legislation, including aspects of public health insurance exchanges, Medicaid expansion, enforcement related reporting for the individual and employer mandates, and reinsurance, risk corridor and risk adjustment, require further guidance and clarification at the federal level and/or in the form of regulations and actions by state legislatures to implement the law. In addition, pending efforts in the U.S. Congress to amend or restrict funding for various aspects of health care reform, and litigation challenging aspects of the law continue to create additional uncertainty about the ultimate impact of health care reform. As a result, many of the impacts of health care reform will not be known for the next several years. Other important risk factors include: adverse changes in health care reform and/or other federal or state government policies or regulations as a result of health care reform or otherwise (including legislative, judicial or regulatory measures that would affect our business model, restrict funding for or amend various aspects of health care reform, limit our ability to price for the risk we assume and/or reflect reasonable costs or profits in our pricing, such as mandated minimum medical benefit ratios, or eliminate or reduce ERISA pre-emption of state laws (increasing our potential litigation exposure)); adverse and less predictable economic conditions in the U.S. and abroad (including unanticipated levels of, or increases in the rate of, unemployment); our ability to diversify our sources of revenue and earnings (including by expanding our direct-to-consumer sales and capabilities and our foreign operations), transform our business model, develop new products and optimize our business platforms; the success of our Healthagen®, Accountable Care Solutions and health information technology initiatives; adverse changes in size, product or geographic mix or medical cost experience of membership; managing executive succession and key talent retention, recruitment and development; failure to achieve and/or delays in achieving desired rate increases and/or profitable membership growth due to regulatory review or other regulatory restrictions, the difficult economy and/or significant competition, especially in key geographic areas where membership is concentrated, including successful protests of business awarded to us; failure to adequately implement health care reform; reputational or financial issues arising from our social media activities, data security breaches, other cybersecurity risks or other causes; the outcome of various litigation and regulatory matters, including audits, challenges to our minimum MLR rebate methodology and/or reports, guaranty fund assessments, intellectual property litigation and litigation concerning, and ongoing reviews by various regulatory authorities of, certain of our payment practices with respect to out-of-network providers and/or life insurance policies; our ability to integrate, simplify, and enhance our existing information technology systems and platforms to keep pace with changing customer and regulatory needs; our ability to successfully integrate our businesses (including Coventry, the InterGlobal group, bSwift and other businesses we may acquire in the future) and implement multiple strategic and operational initiatives simultaneously; our ability to manage health care and other benefit costs; adverse program, pricing, funding or audit actions by federal or state government payors, including as a result of sequestration and/or curtailment or elimination of the Centers for Medicare & Medicaid Services' star rating bonus payments; our ability to reduce administrative expenses while maintaining targeted levels of service and operating performance; failure by a service provider to meet its obligations to us; our ability to develop and maintain relationships (including collaborative risk-sharing agreements) with providers while taking actions to reduce medical costs and/or expand the services we offer; our ability to demonstrate that our products lead to access to quality care by our members; our ability to maintain our relationships with third-party brokers, consultants and agents who sell our products; increases in medical costs or Group Insurance claims resulting from any epidemics, acts of terrorism or other extreme events; changes in medical cost estimates due to the necessary extensive judgment that is used in the medical cost estimation process, the considerable variability inherent in such estimates, and the sensitivity of such estimates to changes in medical claims payment patterns and changes in medical cost trends; the ability to successfully complete the implementation of our agreement with CVS Caremark Corporation on a timely basis and to achieve projected operating efficiencies for the agreement; a downgrade in our financial ratings; and adverse impacts from any failure to raise the U.S. Federal government's debt ceiling or any sustained U.S. Federal government shut down. For more discussion of important risk factors that may materially affect Aetna, please see the risk factors contained in Aetna's 2013 Annual Report on Form 10-K ('Aetna's 2013 Annual Report') on file with the Securities and Exchange Commission (the 'SEC'). You also should read Aetna’s 2013 Annual Report and Aetna's Quarterly Report on Form 10-Q for the quarter ended September 30, 2014, each on file with the SEC, and Aetna's 2014 Annual Report on Form 10-K, when filed with the SEC, for a discussion of Aetna’s historical results of operations and financial condition."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "AET",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0004\004\AET_0001122304_EX991_20150203_EX-99_excerpt.txt",
    "time_elapsed": 0.3,
    "batch_number": 4,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 21:15:41.037609",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 21:28:47.157553"
}