{
    "sec_cik": "0000004281",
    "sec_company_name": "Arconic Inc. (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20190206",
    "sec_filing_date": "20190206",
    "sec_changed_date": "20190206",
    "sec_accepted_date": "20190206165804",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/4281/000114420419005356/0001144204-19-005356-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/4281/000114420419005356/0001144204-19-005356.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0008\001\ARNC_0000004281_EX991_20190206_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "11745 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 7656,
    "endpoints": [
        "Exhibit 99.1 ",
        "This release contains statements that relate to future events and expectations and as such constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include those containing such words as “anticipates,” “believes,” “could,” “estimates,” “expects,” “forecasts,” “goal,” “guidance,” “intends,” “may,” “outlook,” “plans,” “projects,” “seeks,” “sees,” “should,” “targets,” “will,” “would,” or other words of similar meaning. All statements that reflect Arconic’s expectations, assumptions or projections about the future, other than statements of historical fact, are forward-looking statements, including, without limitation, statements and guidance regarding future financial results or operating performance; statements about Arconic's strategies, outlook, business and financial prospects; and statements regarding the strategy and portfolio review. These statements reflect beliefs and assumptions that are based on Arconic’s perception of historical trends, current conditions and expected future developments, as well as other factors Arconic believes are appropriate in the circumstances. Forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and changes in circumstances that are difficult to predict, which could cause actual results to differ materially from those indicated by these statements. Such risks and uncertainties include, but are not limited to: (a) deterioration in global economic and financial market conditions generally; (b) unfavorable changes in the markets served by Arconic; (c) the inability to achieve the level of revenue growth, cash generation, cost savings, improvement in profitability and margins, fiscal discipline, or strengthening of competitiveness and operations anticipated or targeted; (d) competition from new product offerings, disruptive technologies or other developments; (e) political, economic, and regulatory risks relating to Arconic’s global operations, including compliance with U.S. and foreign trade and tax laws, sanctions, embargoes and other regulations; (f) manufacturing difficulties or other issues that impact product performance, quality or safety; (g) Arconic’s inability to realize expected benefits, in each case as planned and by targeted completion dates, from acquisitions, divestitures, facility closures, curtailments, expansions, or joint ventures; (h) the impact of cyber attacks and potential information technology or data security breaches; (i) changes in discount rates or investment returns on pension assets; (j) the impact of changes in aluminum prices and foreign currency exchange rates on costs and results; (k) the outcome of contingencies, including legal proceedings, government or regulatory investigations, and environmental remediation, which can expose Arconic to substantial costs and liabilities; and (l) the other risk factors summarized in Arconic’s Form 10-K for the year ended December 31, 2017 and other reports filed with the U.S. Securities and Exchange Commission (SEC). Market projections are subject to the risks discussed above and other risks in the market. The statements in this release are made as of the date of this release, even if subsequently made available by Arconic on its website or otherwise. Arconic disclaims any intention or obligation to update publicly any forward-looking statements, whether in response to new information, future events, or otherwise, except as required by applicable law."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "ARNC",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0008\001\ARNC_0000004281_EX991_20190206_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 8,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 22:35:47.811513",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 22:38:56.279287"
}