{
    "sec_cik": "0001113169",
    "sec_company_name": "PRICE T ROWE GROUP INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20200219",
    "sec_filing_date": "20200219",
    "sec_changed_date": "20200219",
    "sec_accepted_date": "20200219092022",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1113169/000111316920000011/0001113169-20-000011-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1113169/000111316920000011/0001113169-20-000011.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\004\TROW_0001113169_EX991_20200219_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "148068 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 58817,
    "endpoints": [
        "exhibit991trowinvestorda   ",
        "Important information This material, including any statements, information, data and content contained within it and any materials, information, images, links, graphics or recordings provided in conjunction with this material are being furnished by T. Rowe Price for general informational purposes only. Under no circumstances should the material, in whole or part, be copied or distributed without consent from T. Rowe Price. The views contained herein are as of the date of the presentation. The information and data obtained from third-party sources which is contained in the report were obtained from the sources deemed reliable; however, its accuracy and completeness is not guaranteed. The products and services discussed in this presentation are available via subsidiaries of T. Rowe Price Group as authorized in countries throughout the world. The products and services are not available to all investors or in all countries. Visit troweprice.com to learn more about the products and services available in your country and the T. Rowe Price Group subsidiary which is authorized to provide them. The material is not intended for use by persons in jurisdictions which prohibit or restrict the distribution of the material and in certain countries the material is provided upon specific request. The material does not constitute a distribution, offer, invitation, recommendation or solicitation to sell or buy any securities in any jurisdiction. The material has not been reviewed by any regulatory authority in any jurisdiction. The material does not constitute advice of any nature, and prospective investors are recommended to seek independent legal, financial, and tax advice before making any investment decision. The “S&P 500 Index” and the “S&P Target Date Indices” are products of S&P Dow Jones Indices LLC, a division of S&P Global, or its affiliates (“SPDJI”), and has been licensed for use by T. Rowe Price. Standard & Poor’s® and S&P® are registered trademarks of Standard & Poor’s Financial Services LLC, a division of S&P Global (“S&P”); Dow Jones® is a registered trademark of Dow Jones Trademark Holdings LLC (“Dow Jones”). T. Rowe Price’s product is not sponsored, endorsed, sold or promoted by SPDJI, Dow Jones, S&P or their respective affiliates, and none of such parties make any representation regarding the advisability of investing in such product nor do they have any liability for any errors, omissions, or interruptions of the “S&P 500 Index” and the “S&P Target Date Indices”. Copyright © 2020, S&P Global Market Intelligence (and its affiliates, as applicable). Reproduction of any information, data or material, including ratings (“Content”) in any form is prohibited except with the prior written permission of the relevant party. Such party, its affiliates and suppliers (“Content Providers”) do not guarantee the accuracy, adequacy, completeness, timeliness or availability of any Content and are not responsible for any errors or omissions (negligent or otherwise), regardless of the cause, or for the results obtained from the use of such Content. In no event shall Content Providers be liable for any damages, costs, expenses, legal fees, or losses (including lost income or lost profit and opportunity costs) in connection with any use of the Content. A reference to a particular investment or security, a rating or any observation concerning an investment that is part of the Content is not a recommendation to buy, sell or hold such investment or security, does not address the suitability of an investment or security and should not be relied on as investment advice. Credit ratings are statements of opinions and are not statements of fact. ©2020 Morningstar, Inc. All rights reserved. The information contained herein: (1) is proprietary to Morningstar and/or its content providers; (2) may not be copied or distributed; and (3) is not warranted to be accurate, complete, or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance is no guarantee of future results. London Stock Exchange Group plc and its group undertakings (collectively, the “LSE Group”). © LSE Group 2020. FTSE Russell is a trading name of certain of the LSE Group companies. All rights in the FTSE Russell indexes or data vest in the relevant LSE Group company which owns the index or the data. Neither LSE Group nor its licensors accept any liability for any errors or omissions in the indexes or data and no party may rely on any indexes or data contained in this communication. No further distribution of data from the LSE Group is permitted without the relevant LSE Group company’s express written consent. The LSE Group does not promote, sponsor or endorse the content of this communication. © 2020 T. Rowe Price. All Rights Reserved. T. ROWE PRICE, INVEST WITH CONFIDENCE, and the Bighorn Sheep design are, collectively and/or apart, trademarks of T. Rowe Price Group, Inc. All other trademarks are the property of T. Rowe Price or their respective owners. T. ROWE PRICE GROUP, INC. INVESTOR DAY 2020 7572"
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "TROW",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\004\TROW_0001113169_EX991_20200219_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 9,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 23:34:09.101264",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 23:47:52.903051"
}