{
    "sec_cik": "0000072971",
    "sec_company_name": "WELLS FARGO & COMPANY/MN (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20200211",
    "sec_filing_date": "20200212",
    "sec_changed_date": "20200212",
    "sec_accepted_date": "20200212135223",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/72971/000007297120000192/0000072971-20-000192-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/72971/000007297120000192/0000072971-20-000192.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\004\WFC_0000072971_EX991_20200211_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "7651 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 6273,
    "endpoints": [
        "exhibit991orgchanges   ",
        " range of personalized wealth management, investment, asset management, and retirement products and services to clients across its businesses that include Wells Fargo Advisors, The Private Bank, Abbot Downing, and Wells Fargo Asset Management. • Mike Weinbach, who most recently served as the CEO of Chase Home Lending at JPMorgan Chase, will join Wells Fargo in early May as CEO of Consumer Lending, elevating a core competency of the company that provides critical capabilities to fulfill the financial needs of customers. In his new role, Weinbach will be responsible for Home Lending, Auto, Credit Cards & Merchant Services, and Personal Loans. Mack is leading Consumer Lending on an interim basis until Weinbach joins the company. Wells Fargo also is making fundamental changes to the way the company manages operations. These changes will enable the company to strengthen how it serves clients and customers, drive operational excellence, and execute on its regulatory priorities. Each of the company’s business lines has core operations functions led by operations leaders who report to Chief Operating Officer Scott Powell, with joint reporting relationships to business line CEOs. Powell, who reports to Scharf, also is creating a Sales Practices Oversight and Management role that will establish an integrated and consistent approach to sales practice monitoring, analytics, and reporting across the company. Filling this role is Michael Cleary, who joined the company on Feb. 4 from Santander US, where he was co-President of Santander Bank and head of its Consumer and Business Banking division. Separately, the company is creating a new Strategy, Digital Platform & Innovation group, reporting to Scharf and responsible for Corporate Strategy and its Digital and Innovation teams. The formation of this group positions Wells Fargo for the future by enhancing the company’s focus on planning for the digital future and investing in the customer experience. Powell is leading this group on an interim basis while the company conducts a search for the leader. About Wells Fargo Wells Fargo & Company (NYSE: WFC) is a diversified, community-based financial services company with $1.9 trillion in assets. Wells Fargo’s vision is to satisfy our customers’ financial needs and help them succeed financially. Founded in 1852 and headquartered in San Francisco, Wells Fargo provides banking, investment and mortgage products and services, as well as consumer and commercial finance, through 7,400 locations, more than 13,000 ATMs, the internet (wellsfargo.com) and mobile banking, and has offices in 32 countries and territories to support customers who conduct business in the global economy. With approximately 260,000 team members, Wells Fargo serves one in three households in the United States. Wells Fargo & Company was ranked No. 29 on Fortune’s 2019 rankings of America’s largest corporations. Additional information may be found at www.wellsfargo.com | Twitter: @WellsFargo. Contact Information Media Peter Gilchrist, 704-715-3213 peter.gilchrist@wellsfargo.com or Investor Relations John Campbell, 415-396-0523 john.m.campbell@wellsfargo.com ### 2 February 2020 | News Release"
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "WFC",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\004\WFC_0000072971_EX991_20200211_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 9,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 23:34:09.101264",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 23:49:29.103372"
}