{
    "sec_cik": "0000912595",
    "sec_company_name": "MID AMERICA APARTMENT COMMUNITIES INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20180207",
    "sec_filing_date": "20180207",
    "sec_changed_date": "20180207",
    "sec_accepted_date": "20180207172311",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/912595/000114420418006359/0001144204-18-006359-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/912595/000114420418006359/0001144204-18-006359.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\003\MAA_0000912595_EX991_20180207_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "68800 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 43092,
    "endpoints": [
        "Exhibit 99.1 ",
        "DEFINITIONS OF NON - GAAP FINANCIAL MEASURES CAPITAL MARKETS UPDATE 36 Post Adjusted Same Store Portfolio Post Adjusted Same Store Portfolio represents the Post Properties same store portfolio that would have been in effect had the properties been owned by MAA since January 1, 2016. Prior year results have been adjusted for consistency with MAA accounting policies and year over year comparisons. The primary adjustments include moving corporate property management expenses, exterior paint costs and IT operating systems costs out of property expenses. Because these properties have only been owned by MAA since December 1, 2016, they were not included in the MAA Same Store Portfolio for periods prior to January 2018. See MA A Same Store Portfolio for more information regarding inclusion. These properties have been identified in certain tables to pr ovi de Combined Adjusted Same Store results as if the properties had been owned by MAA in prior periods. These properties became eligible to join the MAA Same Store portfolio in January 2018. Stabilized Communities Communities are considered stabilized after achieving at least 90% occupancy for 90 days. Total Market Capitalization Total Market Capitalization equals the number of shares of common stock plus units not held by MAA at period end multiplied by the closing stock price at period end, plus total debt outstanding. Unencumbered NOI Unencumbered NOI represents NOI generated by our unencumbered assets (as defined in MAALP's bond covenants)."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "MAA",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\003\MAA_0000912595_EX991_20180207_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 7,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 22:17:42.947739",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 22:25:40.859388"
}