{
    "sec_cik": "0001039684",
    "sec_company_name": "ONEOK INC /NEW/ (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20180216",
    "sec_filing_date": "20180216",
    "sec_changed_date": "20180216",
    "sec_accepted_date": "20180216172713",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1039684/000103968418000012/0001039684-18-000012-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1039684/000103968418000012/0001039684-18-000012.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\003\OKE_0001039684_EX991_20180216_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "3093 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 2025,
    "endpoints": [
        "a021518oksk1availablenr  ",
        " News ONEOK Posts Schedule K-1 Online TULSA, Okla. – Feb. 15, 2018 – ONEOK, Inc. (NYSE: OKE) today announced that 2017 tax packages for ONEOK Partners, including a final Schedule K-1, will be available online beginning Friday, March 2, 2018, and may be accessed through the ONEOK website at www.oneok.com or directly from this link. The ONEOK Partners 2017 tax packages are expected to begin mailing by Monday, March 5, 2018. For additional information, former ONEOK Partners unitholders may call the tax package support staff toll free at 800-371-2188. On June 30, 2017, ONEOK completed a merger transaction with ONEOK Partners. Under the terms of the merger agreement, ONEOK acquired all of the 171.5 million outstanding units of ONEOK Partners it did not already own at a fixed exchange ratio of 0.985 of a share of ONEOK common stock for each public unit of ONEOK Partners. ONEOK Partners common units are no longer publicly traded on the New York Stock Exchange. ------------------------------------------------------------------------------------------------------------------- ONEOK, Inc. (pronounced ONE-OAK) (NYSE: OKE) is one of the largest energy midstream service providers in the U.S., connecting prolific supply basins with key market centers. It owns and operates one of the nation's premier natural gas liquids (NGL) systems and is a leader in the gathering, processing, storage and transportation of natural gas. ONEOK’s operations include a 38,000-mile integrated network of NGL and natural gas pipelines, processing plants, fractionators and storage facilities in the Mid-Continent, Williston, Permian and Rocky Mountain regions. ONEOK is a FORTUNE 500 company and is included in Standard & Poor's (S&P) 500 index. For information about ONEOK, Inc., visit the website: www.oneok.com. For the latest news about ONEOK, find us on LinkedIn, Facebook or Twitter @ONEOK. ### February 15, 2018 Analyst Contact: Megan Patterson 918-561-5325 Media Contact: Stephanie Higgins 918-591-5026"
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "OKE",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0007\003\OKE_0001039684_EX991_20180216_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 7,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 22:17:42.947739",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 22:26:16.519848"
}