{
    "sec_cik": "0000037996",
    "sec_company_name": "FORD MOTOR CO (Filer)",
    "document_type": "EX99",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20220202",
    "sec_filing_date": "20220202",
    "sec_changed_date": "20220202",
    "sec_accepted_date": "20220202092012",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/37996/000003799622000008/0000037996-22-000008-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/37996/000003799622000008/0000037996-22-000008.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\002\F_0000037996_EX99_20220202_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "7243 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 6442,
    "endpoints": [
        "exhibit99january2022sale   ",
        "▪ Ford hit an all-time record for both new retail vehicle orders and for filling retail orders in January. Ford took in over 90,000 new vehicle orders in January – up 71,000 from a year ago and up 20,000 from December. Vehicles are moving off dealer lots at a record pace, as 37 percent of Ford’s retail sales in January came from previously placed customer orders. ▪ On the strength of new must-have products, Ford brand sales were up 1.4 percent. The overall industry declined 9.0 percent. Overall, Ford and Lincoln total share in January was 13.9 percent – up 1.3 percentage points from a year ago. ▪ Electrified vehicle sales had their best start ever, with record January sales. Ford electrified vehicle sales in January grew almost 4 times faster than the overall electrified segment. With a total of 13,169 vehicles sold, Ford electrified vehicles were up 167.2 percent, with share up 5.0 points to 10.9 percent of segment. ▪ Sparking additional momentum this year, more than 300 small, medium and large business customers place orders for 10,000 all- electric E-Transit vans; Walmart to take delivery of 1,100 E-Transits. ▪ Ford pickups, including F-Series, Ranger and Maverick, totaled 62,293 sales, outselling GM’s entire pickup truck line in January. F- Series sales in January totaled 50,543. Overall F-Series share increased 0.5 percentage points over last year and begins the year as America’s best-selling pickup. ▪ Ford brand SUV sales totaled 60,382 in January – giving Ford a record SUV start to the 2022 calendar year. New SUV products, including Bronco, Bronco Sport and Mustang Mach-E, added 16,692 vehicles to the SUV sales portfolio, while Escape sales posted a strong gain of 17.2 percent over a year ago. ▪ With continued industry segmentation out of cars and Ford’s focus on trucks and SUVs, Ford saw higher market share and transaction pricing up $4,900 over a year ago. ▪ In 2021, Ford saw continued growth in membership of Ford Pass and Lincoln Way apps. U.S. members totaled nearly 8 million. About Ford Motor Company Ford Motor Company (NYSE: F) is a global company based in Dearborn, Michigan, that is committed to helping build a better world, where every person is free to move and pursue their dreams. The company’s Ford+ plan for growth and value creation combines existing strengths, new capabilities and always-on relationships with customers to enrich experiences for and deepen the loyalty of those customers. Ford designs, manufactures, markets and services a full line of connected, increasingly electrified passenger and commercial vehicles: Ford trucks, utility vehicles, vans and cars, and Lincoln luxury vehicles. The company is pursuing leadership positions in electrification, connected vehicle services and mobility solutions, including self-driving technology, and provides financial services through Ford Motor Credit Company. Ford employs about 184,000 people worldwide. More information about the company, its products and Ford Motor Credit Company is available at corporate.ford.com. *U.S. sales volume reflects transactions with (i) retail and fleet customers (as reported by dealers), (ii) government and (iii) Ford management. Average transaction pricing based on J.D. Power and Associates PIN data. J A N U A R Y 2 0 2 2 S A L E S “Ford market share increased over a year ago on strong demand for our newest products such as Bronco, Maverick and Mach-E. Ford took in a record 90,000 new vehicle orders in January. Vehicles are turning at a record pace on dealer lots, as we work to fill these orders. This year represents a turning point for Ford in electrified vehicles, as our electrified portfolio grew at nearly four times the rate of the industry segment, with E-Transit and F-150 Lightning set to hit the market.” – Andrew Frick, vice president, Ford Sales U.S. and Canada Ford Begins 2022 With Record Electrified and SUV Sales Momentum; Electrified Vehicle Sales Expand At Almost 4 Times Rate Of Overall Industry Segment; F-Series Hits 40 Millionth Sale; January New Retail Vehicle Orders Hit 90,000 – A New Record H I G H L I G H T S M U S T - H A V E P R O D U C T S Ford begins the year with F-Series, Ranger and Maverick pickups outselling GM’s combined pickup sales in January. January sales mark 40 million F-Series pickups sold since 1948. Ford’s all-new Maverick totals 6,513 sales, with 3,549 of these trucks sold as hybrids. Overall, Ford pickup sales are up 1.5 percent. Ford Pro Ford SUVs Lincoln SUVs www.twitter.com/Ford Ford Trucks Ford Performance Ford SUVs carry through from last year’s strong finish to begin the year with a record sales start. Sales were up 12.0 percent over last year, with 60,382 SUVs sold. The Bronco family of vehicles, including Bronco and Bronco Sport sales, were up 77.9 percent. With these additions, Ford is seeing a record percentage of 4x4 and AWD equipped SUVs. In January, 76.7 percent of Ford’s SUVs were equipped with 4x4/AWD – up 20.7 percent over last year and driving SUV transaction pricing to $43,300 per SUV – up $8,200 over a year ago. Total Sales vs. Jan. 2021 Retail Sales vs. Jan. 2021 Total Vehicle Truck SUV Electrified Total U.S. Sales 143,531 71,734 66,122 13,169 0.0% 0.8% -4.3% -4.0% 8.5% 9.4% 167.2% 183.1% As a technology and EV leader, Ford Pro offers a complete portfolio of vehicles and digital solutions for running an efficient business, transforming the way America works. America’s best-selling van, the Transit, has taken 10,000 orders for its upcoming all-new fully electric E- Transit. Ford has 43 straight years of commercial van leadership that will be leveraged with Ford Pro Intelligence, a cloud-based platform that powers a suite of digital services to support a commercial customer’s total fleet operation. The Mustang family of vehicles, Mustang and the all-electric Mach-E, produced sales of 8,041 – up 76.3 percent over last year. Mustang Mach-E sales totaled 2,370, while turning on dealer lots in just 14 days, with a mix of 27.3 percent GT. Mustang Mach-E starts the year second only to Tesla’s Model-Y in the full electric SUV segment. Sales of Lincoln’s best-selling SUV, the Corsair, totaled 2,120 – up 16.0 percent over December. Lincoln is seeing record new vehicle orders over the last five months. January was no exception with over 3,100 new retail vehicle orders placed – this is up 291 percent compared to last year and a new record for Lincoln."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "F",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\002\F_0000037996_EX99_20220202_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 11,
    "batch_signature": "",
    "batch_start_time": "2023-04-17 00:20:00.439699",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-17 00:24:28.757374"
}