{
    "sec_cik": "0001281761",
    "sec_company_name": "REGIONS FINANCIAL CORP (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20160223",
    "sec_filing_date": "20160223",
    "sec_changed_date": "20160223",
    "sec_accepted_date": "20160223164211",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1281761/000128176116000112/0001281761-16-000112-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1281761/000128176116000112/0001281761-16-000112.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0005\001\RF_0001281761_EX991_20160223_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "40250 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 30953,
    "endpoints": [
        "a2016investordeckv7  ",
        "® • Current and future economic and market conditions in the United States generally or in the communities we serve, including the effects of declines in property values, unemployment rates and potential reductions of economic growth, which may adversely affect our lending and other businesses and our financial results and conditions. • Possible changes in trade, monetary and fiscal policies of, and other activities undertaken by, governments, agencies, central banks and similar organizations, which could have a material adverse effect on our earnings. • The effects of a possible downgrade in the U.S. government’s sovereign credit rating or outlook, which could result in risks to us and general economic conditions that we are not able to predict. • Possible changes in market interest rates or capital markets could adversely affect our revenue and expense, the value of assets and obligations, and the availability and cost of capital and liquidity. • Any impairment of our goodwill or other intangibles, or any adjustment of valuation allowances on our deferred tax assets due to adverse changes in the economic environment, declining operations of the reporting unit, or other factors • Possible changes in the creditworthiness of customers and the possible impairment of the collectability of loans. • Changes in the speed of loan prepayments, loan origination and sale volumes, charge-offs, loan loss provisions or actual loan losses where our allowance for loan losses may not be adequate to cover our eventual losses. • Possible acceleration of prepayments on mortgage-backed securities due to low interest rates, and the related acceleration of premium amortization on those securities. • Our ability to effectively compete with other financial services companies, some of whom possess greater financial resources than we do and are subject to different regulatory standards than we are. • Loss of customer checking and savings account deposits as customers pursue other, higher-yield investments, which could increase our funding costs. • Our inability to develop and gain acceptance from current and prospective customers for new products and services in a timely manner could have a negative impact on our revenue. • The effects of any developments, changes or actions relating to any litigation or regulatory proceedings brought against us or any of our subsidiaries. • Changes in laws and regulations affecting our businesses, such as the Dodd-Frank Act and other legislation and regulations relating to bank products and services, as well as changes in the enforcement and interpretation of such laws and regulations by applicable governmental and self-regulatory agencies, which could require us to change certain business practices, increase compliance risk, reduce our revenue, impose additional costs on us, or otherwise negatively affect our businesses. • Our ability to obtain a regulatory non-objection (as part of the CCAR process or otherwise) to take certain capital actions, including paying dividends and any plans to increase common stock dividends, repurchase common stock under current or future programs, or redeem preferred stock or other regulatory capital instruments, may impact our ability to return capital to stockholders and market perceptions of us. • Our ability to comply with stress testing and capital planning requirements (as part of the CCAR process or otherwise) may continue to require a significant investment of our managerial resources due to the importance and intensity of such tests and requirements. • Our ability to comply with applicable capital and liquidity requirements (including, among other things, the Basel III capital standards and the LCR rule), including our ability to generate capital internally or raise capital on favorable terms, and if we fail to meet requirements, our financial condition could be negatively impacted. • The Basel III framework calls for additional risk-based capital surcharges for globally systemically important banks. Although we are not subject to such surcharges, it is possible that in the future we may become subject to similar surcharges. • The costs, including possibly incurring fines, penalties, or other negative effects (including reputational harm) of any adverse judicial, administrative, or arbitral rulings or proceedings, regulatory enforcement actions, or other legal actions to which we or any of our subsidiaries are a party, and which may adversely affect our results. • Our ability to manage fluctuations in the value of assets and liabilities and off-balance sheet exposure so as to maintain sufficient capital and liquidity to support our business. • Our ability to execute on our strategic and operational plans, including our ability to fully realize the financial and non-financial benefits relating to our strategic initiatives. • The success of our marketing efforts in attracting and retaining customers. • Possible changes in consumer and business spending and saving habits and the related effect on our ability to increase assets and to attract deposits, which could adversely affect our net income. • Our ability to recruit and retain talented and experienced personnel to assist in the development, management and operation of our products and services may be affected by changes in laws and regulations in effect from time to time. • Fraud or misconduct by our customers, employees or business partners. • Any inaccurate or incomplete information provided to us by our customers or counterparties. • The risks and uncertainties related to our acquisition and integration of other companies. • Inability of our framework to manage risks associated with our business such as credit risk and operational risk, including third-party vendors and other service providers, which could, among other things, result in a breach of operating or security systems as a result of a cyber attack or similar act. • The inability of our internal disclosure controls and procedures to prevent, detect or mitigate any material errors or fraudulent acts. • The effects of geopolitical instability, including wars, conflicts and terrorist attacks and the potential impact, directly or indirectly, on our businesses. • The effects of man-made and natural disasters, including fires, floods, droughts, tornadoes, hurricanes, and environmental damage, which may negatively affect our operations and/or our loan portfolios and increase our cost of conducting business. • Changes in commodity market prices and conditions could adversely affect the cash flows of our borrowers operating in industries that are impacted by changes in commodity prices (including businesses indirectly impacted by commodities prices such as businesses that transport commodities or manufacture equipment used in the production of commodities), which could impair their ability to service any loans outstanding to them and/or reduce demand for loans in those industries. • Our inability to keep pace with technological changes could result in losing business to competitors. • Our ability to identify and address cyber-security risks such as data security breaches, “denial of service” attacks, “hacking” and identity theft, a failure of which could disrupt our business and result in the disclosure of and/or misuse or misappropriation of confidential or proprietary information; increased costs; losses; or adverse effects to our reputation. • Significant disruption of, or loss of public confidence in, the Internet and services and devices used to access the Internet could affect the ability of our customers to access their accounts and conduct banking transactions. • Possible downgrades in our credit ratings or outlook could increase the costs of funding from capital markets. • The effects of problems encountered by other financial institutions that adversely affect us or the banking industry generally could require us to change certain business practices, reduce our revenue, impose additional costs on us, or otherwise negatively affect our businesses. • The effects of the failure of any component of our business infrastructure provided by a third party could disrupt our businesses; result in the disclosure of and/or misuse of confidential information or proprietary information; increase our costs; negatively affect our reputation; and cause losses. • Our ability to receive dividends from our subsidiaries could affect our liquidity and ability to pay dividends to stockholders. • Changes in accounting policies or procedures as may be required by the FASB or other regulatory agencies could materially affect how we report our financial results. • Other risks identified from time to time in reports that we file with the SEC. • The effects of any damage to our reputation resulting from developments related to any of the items identified above. The foregoing list of factors is not exhaustive. For discussion of these and other factors that may cause actual results to differ from expectations, look under the captions “Forward-Looking Statements” and “Risk Factors' of Regions' Annual Report on Form 10-K for the year ended December 31, 2015, as filed with the Securities and Exchange Commission. The words “anticipates,” “intends,” “plans,” “seeks,” “believes,” “estimates,” “expects,” “targets,” “projects,” “outlook,” “forecast,” “will,” “may,” “could,” “should,” “can,” and similar expressions often signify forward-looking statements. You should not place undue reliance on any forward-looking statements, which speak only as of the date made. We assume no obligation to update or revise any forward-looking statements that are made from time to time. This presentation may include forward-looking statements, as defined in the Private Securities Litigation Reform Act of 1995, which reflect Regions’ current views with respect to future events and financial performance. Forward- looking statements are not based on historical information, but rather are related to future operations, strategies, financial results or other developments. Forward-looking statements are based on management’s expectations as well as certain assumptions and estimates made by, and information available to, management at the time the statements are made. Those statements are based on general assumptions and are subject to various risks, uncertainties and other factors that may cause actual results to differ materially from the views, beliefs and projections expressed in such statements. These risks, uncertainties and other factors include, but are not limited to, those described below: Forward-looking statements 21"
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "RF",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0005\001\RF_0001281761_EX991_20160223_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 5,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 21:41:24.213091",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 21:42:00.247360"
}