{
    "sec_cik": "0000721371",
    "sec_company_name": "CARDINAL HEALTH INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20220110",
    "sec_filing_date": "20220110",
    "sec_changed_date": "20220110",
    "sec_accepted_date": "20220110065830",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/721371/000072137122000004/0000721371-22-000004-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/721371/000072137122000004/0000721371-22-000004.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\004\CAH_0000721371_EX991_20220110_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "13006 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 8147,
    "endpoints": [
        "Document",
        "This release contains forward-looking statements addressing expectations, prospects, estimates and other matters that are dependent upon future events or developments. These statements may be identified by words such as 'expect,' 'anticipate,' 'intend,' 'plan,' 'believe,' “will,' 'should,' 'could,' 'would,' 'project,' 'continue, 'likely,' and similar expressions, and include statements reflecting future results or guidance, statements of outlook and various accruals and estimates. These matters are subject to risks and uncertainties that could cause actual results to differ materially from those projected, anticipated or implied. These risks and uncertainties include risks arising from the ongoing COVID-19 pandemic and our critical role in the global healthcare supply chain, including our ability to recoup or mitigate cost increases and inflation, including costs to source certain personal protective or other equipment, increased costs for transportation, shipping, freight and commodities, reduced price or demand for certain products, which may result in additional inventory reserves, possible workforce issues resulting from COVID-19 vaccine mandates and the possible impact of disruptions of our distribution or manufacturing facilities; the possibility that our Medical unit goodwill could be impaired due to the decreased outlook for Medical segment profit or possible unfavorable changes in the U.S. statutory tax rate; competitive pressures in Cardinal Health's various lines of business; the performance of our generics program, including the amount or rate of generic deflation and our ability to offset generic deflation and maintain other financial and strategic benefits through our generic sourcing venture with CVS Health; risks associated with the distribution of opioids, including the financial impact associated with the proposed settlement agreement and process we have negotiated with governmental authorities, including the risk that we may fail to reach a final settlement agreement or that a significant number of states and subdivisions may not agree to sign on the proposed settlement agreement, the risk that challenges to our plans to take tax deductions for opioid-related losses could adversely impact our financial results and risks arising from the Department of Justice investigation which we believe concerns our anti-diversion program; risks associated with the manufacture and sourcing of certain products, including risks related to our ability and the ability of third-party manufacturers to comply with applicable regulations; our ability to manage uncertainties associated with the pricing of branded pharmaceuticals; and risks associated with our cost savings initiatives including the possibility that they could fail to achieve the intended results. Cardinal Health is subject to additional risks and uncertainties described in Cardinal Health's Form 10-K, Form 10-Q and Form 8-K reports and exhibits to those reports. This release reflects management’s views as of January 10, 2022. Except to the extent required by applicable law, Cardinal Health undertakes no obligation to update or revise any forward-looking statement. Forward-looking statements are aspirational and not guarantees or promises that goals, targets or projections will be met, and no assurance can be given that any commitment, expectation, initiative or plan in this report can or will be achieved or completed. Cardinal Health provides definitions and reconciliations of non-GAAP financial measures and their most directly comparable GAAP financial measures at ir.cardinalhealth.com."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "CAH",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\004\CAH_0000721371_EX991_20220110_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 11,
    "batch_signature": "",
    "batch_start_time": "2023-04-17 00:20:00.439699",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-17 00:31:38.798469"
}