{
    "sec_cik": "0001045609",
    "sec_company_name": "Prologis, Inc. (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20190122",
    "sec_filing_date": "20190122",
    "sec_changed_date": "20190122",
    "sec_accepted_date": "20190122080548",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1045609/000156459019000828/0001564590-19-000828-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1045609/000156459019000828/0001564590-19-000828.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0008\002\PLD_0001045609_EX991_20190122_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "136667 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 112025,
    "endpoints": [
        "pld-ex991_7.pptx.htm    ",
        " (continued) Notes and Definitions 40We define our same store population for the three months ended December 31, 2018 as our owned and managed properties that were in the Operating Portfolio at January 1, 2017 and owned throughout the same three month period in both 2018 and 2017. The same store population excludes non-industrial real estate properties and properties held for sale to third parties, along with development properties that were not stabilized at the beginning of the period (January 1, 2017) and properties acquired or disposed of to third parties during the period. Beginning January 1, 2018, we modified our definition of same store to align on consistent methodologies with members of the industrial REIT group. This did not materially change our historical amounts reported. To derive an appropriate measure of period-to-period operating performance, we remove the effects of foreign currency exchange rate movements by using the reported period end exchange rate to translate from local currency into the U.S. dollar, for both periods. We believe the factors that affect rental revenues, rental recoveries, rental expenses and NOI in the same store portfolio are generally the same as for our consolidated portfolio. As our same store measures are non-GAAP financial measures, they have certain limitations as analytical tools and may vary among real estate companies. As a result, we provide a reconciliation of rental revenues, rental recoveries and rental expenses from our Consolidated Financial Statements prepared in accordance with GAAP to same store property NOI with explanations of how these metrics are calculated. In addition, we further remove certain noncash items (straight-line rent adjustments and amortization of lease intangibles) included in the financial statements prepared in accordance with GAAP to reflect a cash same store number. To clearly label these metrics, they are categorized as same store portfolio NOI – net effective and same store portfolio NOI – cash.The following is a reconciliation of our consolidated rental revenues, rental recoveries, rental expenses and property NOI, as included in the Consolidated Statements of Income, to the respective amounts in our same store portfolio analysis:dollars in thousandsThree Months Ended Dec. 31, 2018 2017 Change (%) Rental revenues: Rental revenues$527,574 $433,568 Rental recoveries 151,621 117,081 Per the Consolidated Statements of Income (a) 679,195 550,649 Adjustments to derive same store results: Properties not included in same store portfolio and other adjustments (a)(b) (187,095) (75,250) Unconsolidated co-investment ventures (a) 537,126 516,687 Same Store - rental revenues - net effective$1,029,226 $992,086 3.7%Straight-line rent adjustments (9,159) (12,580) Fair value lease adjustments 319 106 Same Store - rental revenues - cash$1,020,386 $979,612 4.2% Rental expenses: Per the Consolidated Statements of Income (a)$177,194 $140,338 Adjustments to derive same store results: Properties not included in same store portfolio and other adjustments (a)(c) (47,015) (12,739) Unconsolidated co-investment ventures (a) 123,798 118,447 Same Store - rental expenses - net effective and cash$253,977 $246,046 3.2% Same Store - NOI - Net Effective$775,249 $746,040 3.9%Same Store - NOI - Net Effective - Prologis Share (d)$448,752 $429,587 4.5% Same Store - NOI - Cash$766,409 $733,566 4.5%Same Store - NOI - Cash - Prologis Share (d)$443,501 $424,408 4.5%We include 100% of the same store NOI from the properties in our same store portfolio. During the periods presented, certain properties owned by us were contributed to a co-investment venture and are included in the same store portfolio. Neither our consolidated results nor those of the co-investment ventures, when viewed individually, would be comparable on a same store basis because of the changes in composition of the respective portfolios from period to period (e.g. the results of a contributed property are included in our consolidated results through the contribution date and in the results of the unconsolidated entities subsequent to the contribution date). As a result, only line items labeled “same store portfolio” are comparable period over period. We exclude non-industrial real estate properties and properties held for sale, along with development properties that were not stabilized at the beginning of the reporting period or properties acquired or disposed of to third parties during the period. We also exclude net termination and renegotiation fees to allow us to evaluate the growth or decline in each property’s rental revenues without regard to one-time items that are not indicative of the property’s recurring operating performance. Net termination and renegotiation fees represent the gross fee negotiated to allow a customer to terminate or renegotiate their lease, offset by the write-off of the asset recorded due to the adjustment to straight-line rents over the lease term. Rental expenses include the direct operating expenses of the property such as property taxes, insurance and utilities. In addition, we include an allocation of the property management expenses for our consolidated properties based on the property management services provided to each property (generally, based on a percentage of revenues). On consolidation, these amounts are eliminated and the actual costs of providing property management services are recognized as part of our consolidated rental expenses. These expenses fluctuate based on the level of properties included in the same store portfolio and any adjustment is included as “effect of changes in foreign currency exchange rates and other” in this table.Same Store- NOI- Prologis Share is calculated using the underlying building information from the Same Store NOI – Net Effective and NOI - Cash calculations and applying our ownership percentage as of December 31, 2018 to the NOI of each building for both periods.Same Store Average Occupancy represents the average occupied percentage of the Same Store portfolio for the period. Stabilization is defined as the earlier of when a property that was developed has been completed for one year or is 90% occupied. Upon Stabilization, a property is moved into our Operating Portfolio.Stabilized NOI is equal to the estimated twelve months of potential gross rental revenue (base rent, including above or below market rents plus operating expense reimbursements) multiplied by 95% to adjust income to a stabilized vacancy factor of 5%, minus estimated operating expenses.Total Expected Investment (“TEI”) represents total estimated cost of development or expansion, including land, development and leasing costs. TEI is based on current projections and is subject to change. Turnover Costs represent the estimated obligations incurred in connection with the signing of a lease; including leasing commissions and tenant improvements and are presented for leases that commenced during the period. Tenant improvements include costs to prepare a space for a new tenant or a lease renewal with the current tenant. It excludes costs for a first generation lease (i.e. a new development property) and short-term leases of less than one year.Value-Added Properties are properties we have either acquired at a discount and believe we could provide greater returns post-stabilization or properties we expect to repurpose to a higher and better use.Weighted Average Interest Rate is based on the effective rate, which includes the amortization of related premiums and discounts and finance costs. Weighted Average Stabilized Capitalization (“Cap”) Rate is calculated as Stabilized NOI divided by the Acquisition Price."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "PLD",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0008\002\PLD_0001045609_EX991_20190122_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 8,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 22:35:47.811513",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 22:44:56.245848"
}