{
    "sec_cik": "0000037996",
    "sec_company_name": "FORD MOTOR CO (Filer)",
    "document_type": "EX99",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20200106",
    "sec_filing_date": "20200106",
    "sec_changed_date": "20200106",
    "sec_accepted_date": "20200106142053",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/37996/000003799620000003/0000037996-20-000003-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/37996/000003799620000003/0000037996-20-000003.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\002\F_0000037996_EX99_20200106_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "9450 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 5231,
    "endpoints": [
        "exhibit994q2019salespres   ",
        " F-Series Hits 43rd Straight Year as America’s Best-Selling Pickup; Ford Achieves 10 Straight Years of Leadership as America’s Best-Selling Brand; Lincoln SUV Sales Best in 16 Years www.twitter.com/Ford F O U R T H - Q U AR T E R S A L E S 2 0 1 9 Total Vehicle Truck SUV Car U.S. Sales 601,862 330,075 208,387 63,400 Versus Q4 2018 -1.3% 15.9% -4.1% -41.0% H I G H L I G H T S “America’s best-selling brand for the past decade is on a roll. F-Series celebrates 43 years as the country’s favorite truck and 38 years as its overall vehicle, and ƒ Ford truck sales for the year, including pickups and Transit stood at the top of the van podium again. We promised a winning portfolio vans, climbed 9.1 percent with more than 1.24 million and that’s what we’re delivering with more on the way, including Mustang Mach-E, trucks sold. In Q4, Ford’s overall truck sales closed an all-new F-150 and the return of Bronco. It’s going to be an exciting year for new strong, increasing 15.9 percent. It was Ford’s best overall product at Ford.” Q4 truck sales result since 2001. – Mark LaNeve, Ford vice president, U. S. Marketing, Sales and Service ƒ F-Series achieved its 43 rd straight year as America’s best-selling pickup, while Ranger finished its best sales W I N N I N G P O R T F O L I O quarter since its reintroduction in early 2019. Combined The F-Series was again America’s best- sales of F-Series and Ranger totaled almost 1 million selling truck for the 43 rd straight year and pickups at 986,097 vehicles for the year – an increase of for the 38 th straight year America’s best- 8.4 percent. Ranger Q4 sales hit 33,059 pickups for the selling vehicle. With the addition of Ranger, Ford pickups produced their best quarter, totaling 89,571 for the year. sales results since 2005, with a total of ƒ As America’s best-selling commercial van line, Ford’s 986,097 pickups sold. overall van sales delivered their best Q4 results since Ford Trucks 1978 on sales of 59,930 vans. For the year, Ford van Ford Transit was America’s best-selling sales totaled 240,529 vehicles – a 10.5 percent gain. van for 2019 and achieved its best sales performance since its introduction in ƒ Ford Expedition sales posted their best results in over a 2014. Ford has now been America’s best-selling commercial van maker for decade, while EcoSport had its best sales year since 41 straight years. Combined with launch. Expedition sales accelerated in Q4 with a gain of pickups, Ford’s commercial truck sales 71.6 percent, while the affordably priced EcoSport were up 10.1 percent in 2019. Ford Commercial reported gains of 19.1 percent for the year. Expedition sales finished the year with a ƒ Ford Explorer sales gain big. In Q4, on improved big close. Fourth quarter Expedition sales were up 71.6 percent on sales of availability, sales of the all-new Ford Explorer continued to 24,267 bringing overall Expedition sales expand – totaling 48,083 SUVs. This represents a 52.4 to 86,422 for the year – a 58.1 percent percent increase over Q3 volumes. In December, Explorer gain. EcoSport sales were up 19.1 had its strongest monthly retail sales performance since its percent, with 57 percent of retail sales coming from recently discontinued launch in June. passenger cars in the Ford lineup. Ford SUV ƒ Sales of America’s best-selling sports car, the Ford Mustang sales totaled 72,489 cars this Mustang, saw a strong gain of 20.4 percent in the final year, making it America’s best-selling sports car for a fifth straight year. quarter of the year on sales of 17,124 cars. Mustang began its first sales of GT500 ƒ Lincoln SUVs had their best annual sales results since in Q4, with GT350/GT500 sales up 35.2 percent. Explorer ST retail sales were up 2003 on sales of 87,893 SUVs. In Q4, Lincoln SUVs were 29.5 percent in Q4 over last year’s up 30.9 percent, making it Lincoln’s best Q4 sales Explorer Sport, while Raptor pickup sales performance for its SUVs since 2001. were up 12.9 percent over last year. Ford Performance # # # Lincoln continued its growth with the A bout Ford Motor Company strong performance of its new products. Ford Motor Company is a global company based in Dearborn, Michigan. The company As Aviator stock levels build and Aviator designs, manufactures, markets and services a full line of Ford cars, trucks, SUVs, electrified vehicles and Lincoln luxury vehicles, provides financial services through Ford Motor Credit Grand Touring models are added, sales Company and is pursuing leadership positions in electrification, autonomous vehicles and continued to climb posting sales of mobility solutions. Ford employs approximately 191,000 people worldwide. For more 6,424 in Q4. Aviator had its best sales information regarding Ford, its products and Ford Motor Credit Company, please visit performance in December with 2,810 www.corporate.ford.com . SUVs sold. Lincoln Corsair continues to *U.S. sales volume reflects transactions with (i) retail and fleet customers (as reported by grow, representing 43 percent of dealers), (ii) government and (iii) Ford management. Average transaction pricing based on J.D. Lincoln Corsair Corsair/MKC retail sales mix in Power and Associates PIN data. December."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "F",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\002\F_0000037996_EX99_20200106_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 9,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 23:34:09.101264",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 23:39:19.114115"
}