{
    "sec_cik": "0000912595",
    "sec_company_name": "MID AMERICA APARTMENT COMMUNITIES INC. (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20200218",
    "sec_filing_date": "20200218",
    "sec_changed_date": "20200218",
    "sec_accepted_date": "20200218162652",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/912595/000156459020005040/0001564590-20-005040-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/912595/000156459020005040/0001564590-20-005040.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\002\MAA_0000912595_EX991_20200218_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "61915 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 46958,
    "endpoints": [
        "maa-ex991_438.pptx.htm     ",
        " Definitions of Other Key Terms Average Effective Rent per Unit Average Effective Rent per Unit represents the average of gross rent amounts after the effect of leasing concessions for occupied units plus prevalent market rates asked for unoccupied units, divided by the total number of units. Leasing concessions represent discounts to the current market rate. MAA believes average effective rent is a helpful measurement in evaluating average pricing. It does not represent actual rental revenue collected per unit. Average Physical Occupancy Average Physical Occupancy represents the average of the daily physical occupancy for the respective period. Development Communities Communities remain identified as development until certificates of occupancy are obtained for all units under development. Once all units are delivered and available for occupancy, the community moves into the Lease-up Communities portfolio. Lease-up Communities New acquisitions acquired during lease-up and newly developed communities remain in the Lease-up Communities portfolio until stabilized. Communities are considered stabilized after achieving at least 90% occupancy for 90 days. Non-Same Store Portfolio Non-Same Store Portfolio includes recent acquisitions, communities that have been identified for disposition, communities that have undergone a significant casualty loss, and stabilized communities that do not meet the requirements defined by the Same Store Portfolio. Same Store Portfolio MAA reviews its Same Store Portfolio at the beginning of each calendar year, or as significant transactions warrant. Communities are generally added into the Same Store Portfolio if they were owned and stabilized at the beginning of the previous year. Communities are considered stabilized after achieving at least 90% occupancy for 90 days. Communities that have been approved by MAA's Board of Directors for disposition are excluded from the Same Store Portfolio. Communities that have undergone a significant casualty loss are also excluded from the Same Store Portfolio. Unencumbered NOI Unencumbered NOI represents NOI generated by unencumbered assets (as defined in MAALP's bond covenants)."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "MAA",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0009\002\MAA_0000912595_EX991_20200218_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 9,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 23:34:09.101264",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 23:41:30.273098"
}