{
    "sec_cik": "0001103982",
    "sec_company_name": "Mondelez International, Inc. (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20220222",
    "sec_filing_date": "20220222",
    "sec_changed_date": "20220222",
    "sec_accepted_date": "20220222091605",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1103982/000119312522047822/0001193125-22-047822-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1103982/000119312522047822/0001193125-22-047822.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\001\MDLZ_0001103982_EX991_20220222_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "18256 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 9239,
    "endpoints": [
        "EX-99.1   ",
        " security breaches; global or regional health pandemics or epidemics, including COVID-19; competition and the company’s response to channel shifts and pricing and other competitive pressures; promotion and protection of the company’s reputation and brand image; changes in consumer preferences and demand and the company’s ability to innovate and differentiate its products; the restructuring program and the company’s other transformation initiatives not yielding the anticipated benefits; changes in the assumptions on which the restructuring program is based; management of the company’s workforce and shifts in labor availability; consolidation of retail customers and competition with retailer and other economy brands; changes in the company’s relationships with customers, suppliers or distributors; compliance with legal, regulatory, tax and benefit laws and related changes, claims or actions; the impact of climate change on the company’s supply chain and operations; strategic transactions; significant changes in valuation factors that may adversely affect the company’s impairment testing of goodwill and intangible assets; perceived or actual product quality issues or product recalls; failure to maintain effective internal control over financial reporting or disclosure controls and procedures; volatility of and access to capital or other markets, the effectiveness of the company’s cash management programs and the company’s liquidity; pension costs; the expected discontinuance of London Interbank Offered Rates and transition to any other interest rate benchmark; and the company’s ability to protect its intellectual property and intangible assets. Please also see the company’s risk factors, as they may be amended from time to time, set forth in its filings with the U.S. Securities and Exchange Commission (“SEC”), including the company’s most recently filed Annual Report on Form 10-K. Mondelēz International disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "MDLZ",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\001\MDLZ_0001103982_EX991_20220222_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 11,
    "batch_signature": "",
    "batch_start_time": "2023-04-17 00:20:00.439699",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-17 00:23:03.111584"
}