{
    "sec_cik": "0000743988",
    "sec_company_name": "XILINX INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20220209",
    "sec_filing_date": "20220210",
    "sec_changed_date": "20220210",
    "sec_accepted_date": "20220210080711",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/743988/000110465922017449/0001104659-22-017449-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/743988/000110465922017449/0001104659-22-017449.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\001\XLNX_0000743988_EX991_20220209_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "15012 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 6349,
    "endpoints": [
        "Exhibit 99.1 ",
        " The statements in this press release include forward-looking statements concerning AMD, Xilinx, the proposed transaction and other matters. Forward-looking statements may discuss goals, intentions and expectations as to future plans, trends, events, results of operations or financial condition, or otherwise, based on current beliefs and involve numerous risks and uncertainties that could cause actual results to differ materially from expectations. Forward-looking statements speak only as of the date they are made or as of the dates indicated in the statements and should not be relied upon as predictions of future events, as there can be no assurance that the events or circumstances reflected in these statements will be achieved or will occur. Forward-looking statements can often, but not always, be identified by the use of forward-looking terminology including “believes,” “expects,” “may,” “will,” “should,” “seeks,” “intends,” “plans,” “pro forma,” “estimates,” “anticipates,” “designed,” or the negative of these words and phrases, other variations of these words and phrases or comparable terminology. The forward-looking statements in this press release relate to, among other things, satisfying closing conditions to the proposed transaction, the expected timing of closing the transaction, and the integration of the businesses and the expected benefits, cost savings, accretion, synergies and growth to result therefrom. These forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those contemplated by the statements. These risks include, among other things: failure to satisfy other closing conditions to the transaction or to complete the transaction on anticipated terms and timing; negative effects of the announcement of the transaction; risks that the businesses will not be integrated successfully or that the combined company will not realize expected benefits, cost savings, accretion, synergies and/or growth, or that such benefits may take longer to realize than expected; risks relating to unanticipated costs of integration; significant transaction and/or integration costs, or difficulties in connection with the transaction and/or unknown or inestimable liabilities; potential litigation associated with the transaction; the potential impact of the announcement or consummation of the transaction on AMD’s or the combined company’s relationships with suppliers, customers, employers and regulators; and demand for the combined company’s products. For a discussion of factors that could cause actual results to differ materially from those contemplated by forward-looking statements, see the section captioned “Risk Factors” in (i) AMD’s Annual Report on Form 10-K for the fiscal year ended December 25, 2021 and AMD’s other filings with the SEC and (ii) Xilinx’s Annual Report on Form 10-K for the fiscal year ended April 3, 2021, subsequent Quarterly Reports on Form 10-Q and Xilinx’s other filings with the SEC. While the list of factors presented here is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward looking statements. Many of these risks and uncertainties may be exacerbated by the COVID-19 pandemic and any worsening of the global business and economic environment as a result. Neither AMD nor Xilinx assumes, and each hereby disclaims, any obligation to update forward-looking statements, except as may be required by law."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "XLNX",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0011\001\XLNX_0000743988_EX991_20220209_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 11,
    "batch_signature": "",
    "batch_start_time": "2023-04-17 00:20:00.439699",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-17 00:20:55.252788"
}