{
    "sec_cik": "0001035267",
    "sec_company_name": "INTUITIVE SURGICAL INC (Filer)",
    "document_type": "EX991",
    "sec_form_header": "Form 8-K",
    "sec_period_of_report": "20150202",
    "sec_filing_date": "20150202",
    "sec_changed_date": "20150202",
    "sec_accepted_date": "20150202083507",
    "sec_index_url": "https://www.sec.gov//Archives/edgar/data/1035267/000103526715000012/0001035267-15-000012-index.htm",
    "sec_url": "https://www.sec.gov//Archives/edgar/data/1035267/000103526715000012/0001035267-15-000012.txt",
    "metadata_file_name": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0004\003\ISRG_0001035267_EX991_20150202_EX-99_metadata.json",
    "original_file_name": "",
    "original_file_size": "11972 chars",
    "document_group": "EX-99",
    "section_name": "EX-99",
    "section_n_characters": 5096,
    "endpoints": [
        "Ex 99.1 Press Release - Share Repurchase   ",
        "This press release contains forward-looking statements, including statements regarding the repurchase by the Company of up to $1.0 billion of its common stock, the Company's uses of its cash, including the return of excess cash to stockholders, the amount of cash that may be available for stock repurchases, and the timing and form of stock repurchase transactions. These forward-looking statements are necessarily estimates reflecting the best judgment of our management and involve a number of risks and uncertainties that could cause actual results to differ materially from those suggested by the forward-looking statements. These forward-looking statements should, therefore, be considered in light of various important factors, including the following: the market prices of the Company’s common stock; the origin of funds used for such repurchases; the impact of global and regional economic and credit market conditions, as well as the risk of bank failures, insolvency or illiquidity of other financial institutions and other adverse conditions in financial markets that could cause a loss of our cash, cash equivalents and investments; and other risk factors under the heading “Risk Factors” in our report on Form 10-K for the year ended December 31, 2013, as updated by our quarterly reports on Form 10-Q and our other filings with the Securities and Exchange Commission. Statements using words such as “estimates,” “projects,” “believes,” “anticipates,” “plans,” “expects,” “intends,” “may,” “will,” “could,” “should,” “would,” “targeted” and similar words and expressions are intended to identify forward-looking statements. You are cautioned not to place undue reliance on these forward looking statements, which speak only as of the date of this press release. We undertake no obligation to publicly update or release any revisions to these forward-looking statements, except as required by law."
    ],
    "extraction_method": "html",
    "warnings": [],
    "company_description": "ISRG",
    "output_file": "C:\Users\aaron\OneDrive\Desktop\homework\finance2\SEC-EDGAR-text\output_files_examples\batch_0004\003\ISRG_0001035267_EX991_20150202_EX-99_excerpt.txt",
    "time_elapsed": 0.0,
    "batch_number": 4,
    "batch_signature": "",
    "batch_start_time": "2023-04-16 21:15:41.037609",
    "batch_machine_id": "DESKTOP-BTCJU5K",
    "section_end_time": "2023-04-16 21:25:45.751648"
}